def rotate(color,ro):
    tmp = [[0]*3 for i in range(3)]
    if ro == '-': # 반시계
        for i in range(3):
            for j in range(3):
                tmp[2-j][i] = color[i][j]
    else: # 시계
        for i in range(3):
            for j in range(3):
                tmp[j][2-i] = color[i][j]
    return tmp                

def rotation(p,ro):
    global w,y,r,o,g,b
    if p == 'U': # 윗면 기준(흰색)
        if ro == '-': # 반시계방향 으로 돌리기(빨,초,파,오렌지 바뀜)
            # 움직이게 될 좌표들 구하기
            r1,r2,r3,g1,g2,g3 = r[0][0],r[0][1],r[0][2],g[0][0],g[0][1],g[0][2]
            b1,b2,b3,o1,o2,o3 = b[0][0],b[0][1],b[0][2],o[0][0],o[0][1],o[0][2]
            # 방향에 따라 움직인대로 지정해주기
            r[0][0],r[0][1],r[0][2],g[0][0],g[0][1],g[0][2] = g1,g2,g3,o1,o2,o3
            b[0][0],b[0][1],b[0][2],o[0][0],o[0][1],o[0][2] = r1,r2,r3,b1,b2,b3
            w = rotate(w,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기
        else: # 시계방향 돌리기
            # 움직이게 될 좌표들 구하기
            r1,r2,r3,g1,g2,g3 = r[0][0],r[0][1],r[0][2],g[0][0],g[0][1],g[0][2]
            b1,b2,b3,o1,o2,o3 = b[0][0],b[0][1],b[0][2],o[0][0],o[0][1],o[0][2]
            # 방향에 따라 움직인대로 지정해주기
            r[0][0],r[0][1],r[0][2],g[0][0],g[0][1],g[0][2] = b1,b2,b3,r1,r2,r3
            b[0][0],b[0][1],b[0][2],o[0][0],o[0][1],o[0][2] = o1,o2,o3,g1,g2,g3
            w = rotate(w,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기                

    elif p == 'D': # 아래면 기준(노란색)
        if ro == '-': # 반시계방향으로 돌리기(빨,초,파,오렌지 바뀜)
            # 움직이게 될 좌표들 구하기
            r1,r2,r3,g1,g2,g3 = r[2][0],r[2][1],r[2][2],g[2][0],g[2][1],g[2][2]
            b1,b2,b3,o1,o2,o3 = b[2][0],b[2][1],b[2][2],o[2][0],o[2][1],o[2][2]
            # 방향에 따라 움직인대로 지정해주기
            r[2][0],r[2][1],r[2][2],g[2][0],g[2][1],g[2][2] = b1,b2,b3,r1,r2,r3
            b[2][0],b[2][1],b[2][2],o[2][0],o[2][1],o[2][2] = o1,o2,o3,g1,g2,g3
            y = rotate(y,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기
        else: # 시계방향 돌리기
            # 움직이게 될 좌표들 구하기
            r1,r2,r3,g1,g2,g3 = r[2][0],r[2][1],r[2][2],g[2][0],g[2][1],g[2][2]
            b1,b2,b3,o1,o2,o3 = b[2][0],b[2][1],b[2][2],o[2][0],o[2][1],o[2][2]
            # 방향에 따라 움직인대로 지정해주기
            r[2][0],r[2][1],r[2][2],g[2][0],g[2][1],g[2][2] = g1,g2,g3,o1,o2,o3
            b[2][0],b[2][1],b[2][2],o[2][0],o[2][1],o[2][2] = r1,r2,r3,b1,b2,b3
            y = rotate(y,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기                


    elif p == 'F': # 앞면 기준(빨강)
        if ro == '-': # 반시계방향 으로 돌리기(초,흰,파,노 바뀜)
            # 움직이게 될 좌표들 구하기
            g1,g2,g3,w1,w2,w3 = g[0][2],g[1][2],g[2][2],w[2][0],w[2][1],w[2][2]
            b1,b2,b3,y1,y2,y3 = b[0][0],b[1][0],b[2][0],y[0][0],y[0][1],y[0][2]
            # 방향에 따라 움직인대로 지정해주기
            g[0][2],g[1][2],g[2][2],w[2][0],w[2][1],w[2][2] = w3,w2,w1,b1,b2,b3
            b[0][0],b[1][0],b[2][0],y[0][0],y[0][1],y[0][2] = y3,y2,y1,g1,g2,g3
            r = rotate(r,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기
        else: # 시계방향 돌리기
            # 움직이게 될 좌표들 구하기
            g1,g2,g3,w1,w2,w3 = g[0][2],g[1][2],g[2][2],w[2][0],w[2][1],w[2][2]
            b1,b2,b3,y1,y2,y3 = b[0][0],b[1][0],b[2][0],y[0][0],y[0][1],y[0][2]
            # 방향에 따라 움직인대로 지정해주기
            g[0][2],g[1][2],g[2][2],w[2][0],w[2][1],w[2][2] = y1,y2,y3,g3,g2,g1
            b[0][0],b[1][0],b[2][0],y[0][0],y[0][1],y[0][2] = w1,w2,w3,b3,b2,b1
            r = rotate(r,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기                

    elif p == 'B': # 뒷면 기준(오렌지색)
        if ro == '-': # 반시계방향 으로 돌리기(초,흰,파,노 바뀜)
            # 움직이게 될 좌표들 구하기
            g1,g2,g3,w1,w2,w3 = g[0][0],g[1][0],g[2][0],w[0][0],w[0][1],w[0][2]
            b1,b2,b3,y1,y2,y3 = b[0][2],b[1][2],b[2][2],y[2][0],y[2][1],y[2][2]
            # 방향에 따라 움직인대로 지정해주기
            g[0][0],g[1][0],g[2][0],w[0][0],w[0][1],w[0][2] = y1,y2,y3,g3,g2,g1
            b[0][2],b[1][2],b[2][2],y[2][0],y[2][1],y[2][2] = w1,w2,w3,b3,b2,b1
            o = rotate(o,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기
        else: # 시계방향 돌리기
            # 움직이게 될 좌표들 구하기
            g1,g2,g3,w1,w2,w3 = g[0][0],g[1][0],g[2][0],w[0][0],w[0][1],w[0][2]
            b1,b2,b3,y1,y2,y3 = b[0][2],b[1][2],b[2][2],y[2][0],y[2][1],y[2][2]
            # 방향에 따라 움직인대로 지정해주기
            g[0][0],g[1][0],g[2][0],w[0][0],w[0][1],w[0][2] = w3,w2,w1,b1,b2,b3
            b[0][2],b[1][2],b[2][2],y[2][0],y[2][1],y[2][2] = y3,y2,y1,g1,g2,g3
            o = rotate(o,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기                


    elif p == 'L': # 왼쪽면 기준(초록)
        if ro == '-': # 반시계방향 으로 돌리기(흰,빨,노,오렌지 바뀜)
            # 움직이게 될 좌표들 구하기
            w1,w2,w3,r1,r2,r3 = w[0][0],w[1][0],w[2][0],r[0][0],r[1][0],r[2][0]
            y1,y2,y3,o1,o2,o3 = y[0][0],y[1][0],y[2][0],o[0][2],o[1][2],o[2][2]
            # 방향에 따라 움직인대로 지정해주기
            w[0][0],w[1][0],w[2][0],r[0][0],r[1][0],r[2][0] = r1,r2,r3,y1,y2,y3
            y[0][0],y[1][0],y[2][0],o[0][2],o[1][2],o[2][2] = o3,o2,o1,w3,w2,w1
            g = rotate(g,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기
        else: # 시계방향 돌리기
            w1,w2,w3,r1,r2,r3 = w[0][0],w[1][0],w[2][0],r[0][0],r[1][0],r[2][0]
            y1,y2,y3,o1,o2,o3 = y[0][0],y[1][0],y[2][0],o[0][2],o[1][2],o[2][2]
            # 움직이게 될 좌표들 구하기
            w[0][0],w[1][0],w[2][0],r[0][0],r[1][0],r[2][0] = o3,o2,o1,w1,w2,w3
            y[0][0],y[1][0],y[2][0],o[0][2],o[1][2],o[2][2] = r1,r2,r3,y3,y2,y1
            # 방향에 따라 움직인대로 지정해주기
            g = rotate(g,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기                

    elif p == 'R': # 오른쪽면 기준(파랑)
        if ro == '-': # 반시계방향 으로 돌리기(흰,빨,노,오렌지 바뀜)
            # 움직이게 될 좌표들 구하기
            w1,w2,w3,r1,r2,r3 = w[0][2],w[1][2],w[2][2],r[0][2],r[1][2],r[2][2]
            y1,y2,y3,o1,o2,o3 = y[0][2],y[1][2],y[2][2],o[0][0],o[1][0],o[2][0]
            # 방향에 따라 움직인대로 지정해주기
            w[0][2],w[1][2],w[2][2],r[0][2],r[1][2],r[2][2] = o3,o2,o1,w1,w2,w3
            y[0][2],y[1][2],y[2][2],o[0][0],o[1][0],o[2][0] = r1,r2,r3,y3,y2,y1
            b = rotate(b,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기
        else: # 시계방향 돌리기
            w1,w2,w3,r1,r2,r3 = w[0][2],w[1][2],w[2][2],r[0][2],r[1][2],r[2][2]
            y1,y2,y3,o1,o2,o3 = y[0][2],y[1][2],y[2][2],o[0][0],o[1][0],o[2][0]
            # 움직이게 될 좌표들 구하기
            w[0][2],w[1][2],w[2][2],r[0][2],r[1][2],r[2][2] = r1,r2,r3,y1,y2,y3
            y[0][2],y[1][2],y[2][2],o[0][0],o[1][0],o[2][0] = o3,o2,o1,w3,w2,w1
            # 방향에 따라 움직인대로 지정해주기
            b = rotate(b,ro) # 해당하는 면도 시계방향,또는 반시계방향으로 회전시켜주기                

tc = int(input())
for _ in range(tc):
    w = [['w']*3 for _ in range(3)]
    y = [['y']*3 for _ in range(3)]
    r = [['r']*3 for _ in range(3)]
    o = [['o']*3 for _ in range(3)]
    g = [['g']*3 for _ in range(3)]
    b = [['b']*3 for _ in range(3)]

    n = int(input())
    s = input().split()
    for i in s:
        p,ro = list(i)
        rotation(p,ro)
    for i in range(3):
        print(''.join(w[i]))
